[
    "If I had a nickel for every time I saw someone as cute as you, I’d have 5 cents.",
    "Look, I’ve been blinded by your beauty. My insurance company is going to need your name and number.",
    "Are you from Disneyland? They say it’s the happiest place on Earth, so I figured it would be wherever you are.",
    "Are you my laptop? Because you’re really hot, and I’m concerned.",
    "You’ve got the best smile on this app. What’s your secret—Crest?",
    "Could you possibly get me a glass of water? I’m suddenly really thirsty.",
    "Are you one of the pioneers of flight? You seem just Wright for me.",
    "Your eyes are like Ikea. I’m totally lost in them.",
    "Are you my untied shoelace? Because I’m falling for you.",
    "I think I’ve seen you in a book somewhere. It was really fine print.",
    "I want you to know that I am 100% committed to this Tinder relationship.",
    "Are you a model? (No.) Oh, when did you quit?",
    "I’m not a professional photographer, but I can definitely picture us together.",
    "The difference between history and you is that history is the past and you’re my future.",
    "Are you a keyboard? Because I’d like to find out if you’re my type.",
    "You must be a parking ticket because you’ve got fine written all over you.",
    "Are you a magician? Because whenever I look at you, everyone else disappears.",
    "Your hand looks heavy. Want me to hold it for you?",
    "Do you have a map? Because I keep getting lost in your eyes.",
    "I would show you my world, but you already own a mirror.",
    "You must be Lucky Charms because you look magically delicious.",
    "If looks could kill, you’d be a weapon of mass destruction.",
    "Do you have a name? Or can I call you mine?",
    "Why spell bee when you can just say “B”? Why spell see when you can just say “C”? Why spell love when you can just say “me”?",
    "Are you from Tennessee? Because you are the only 10 that I see.",
    "If you like Aladdin, you could be Jasmine … but without the Jas.",
    "I’ll bring the tequila if you give me a shot.",
    "Are you into Legos? Because I’d never lego of you.",
    "I should warn you that I’m a felon … because I felon love with you.",
    "The world is flat—kiss me if I’m wrong.",
    "I must be a light switch because you sure know how to turn me on.",
    "Disney will be so glad—I found their missing princess!",
    "Do you have a Band-Aid? Because I just scraped my knee falling for you.",
    "Do you ever lie down at night, look up at the stars and think about all the messed-up things in the world? Like, why is there a d in fridge but no d in refrigerator?",
    "Do you want to hear a joke about ghosts? (Yes.) That’s the spirit!",
    "You’re seriously cute, but here’s the deal-breaker: Do you or do you not like raisins? (Regardless of the response, offer them a date instead.)",
    "Be honest: Is this match at first sight for you too?",
    "Roses are red. Violets are blue. Yoda I am. Go out with me you will?",
    "Are you French? Because Eiffel for you.",
    "You must be terrible at hide-and-seek. Someone like you is so hard to find!",
    "Look, I won’t flirt with you. I’ll just be extra friendly to someone who is extra attractive.",
    "I’m researching important dates in history. Do you want to be mine?",
    "Do you like bagels? Because you’re bae goals.",
    "If you were a fruit, you’d be a fine-apple.",
    "Do you know what I have in common with the Little Mermaid? We both want to be part of your world.",
    "Are you from space? Because you’re out-of-this-world good-looking.",
    "If you were a vegetable, you’d be a cute-cumber.",
    "What do you call a queue of people lifting mozzarella cheese? A cheesy pickup line.",
    "Do you ever go fishing? Because you’re a real catch.",
    "Are you Australian? Because you meet all my koala-fications.",
    "Roses are red. Violets are blue. How did I get so lucky to match with you?",
    "If you were a Taser, you’d be set to stun.",
    "Do you play soccer? You look like a keeper.",
    "Are you a gardener? I like your tulips.",
    "How much does a polar bear weigh? Enough to break the ice!",
    "Did you fall into a pile of sugar? You’re looking super sweet.",
    "Do you like cheese? Would you like to brie with me?",
    "Just wanted to let you know: You have some cute on your face.",
    "Are your parents bakers? They sure made a cutie pie.",
    "Do you have an Instagram account? Because my mother always told me to follow my dreams.",
    "I think I saw you on Spotify. You were listed as the hottest single.",
    "I thought happiness started with an h, but I guess it actually starts with u.",
    "I bet I know when your birthday is: October. Because you’re a 10.",
    "Is your Bluetooth enabled? I feel like we could pair.",
    "I hope you know CPR because you’re taking my breath away.",
    "Have you been speeding? Because you’ve got fine written all over you.",
    "I need a real estate agent—do you know any? I’m trying to make a move here.",
    "You want to know what’s beautiful? Read that first word again.",
    "Are you HTTPS? Because without you, I’m just ://",
    "Hey, I’m writing an article on the finer things in life, and I was hoping I could interview you.",
    "So I’ve been trying to come up with a good psychology pickup line, but I’m a-Freud I’m drawing a blank.",
    "Is there a rainbow outside? I think I just found gold.",
    "You must be a small amount of red phosphorus, and I must be a tiny wooden stick—we’re a match.",
    "Do you know the square root of two? Because I feel irrational around you.",
    "You must be a carbon sample because I really want to date you.",
    "On a scale of one to America, how free are you this weekend?",
    "Do you have something in your eye? Oh, wait. Never mind. It’s just a sparkle.",
    "My barbecue is broken. Could you have a look at it? (What?) Oh, I thought you might be able to help, being a smoke show and all.",
    "I would ask you to come to the movies with me, but they have a rule against bringing your own snacks.",
    "All your pics came through at a 45-degree angle. Guess you’re acute-y.",
    "What was the last song/movie/TV show you loved?",
    "Describe yourself in three emojis. I’m: (Add your own emojis.)",
    "My favorite pickup line is: (Insert a ridiculous pickup line here). What’s yours?",
    "If you could be any animal in the world for 24 hours, which would you choose?",
    "Titanic. That’s my icebreaker. What’s up?",
    "OK, instead of a Tinder pickup line, here is a riddle for you: You have to choose between three rooms: one full of fire, one full of assassins and one full of lions that haven’t eaten in three years. Which is the safest? (It’s the room with the lions because they’d all be dead.)",
    "Top three favorite dog breeds: Go!",
    "Ready for a GIF war? This is my favorite GIF of all time: (Add your own GIF—we recommend the sassy llama.) Can you beat it?",
    "So when our friends ask how we met, what are we going to tell them?",
    "If you could be anywhere in the world right now, where would it be?",
    "You seem cool. Let’s be friends, get to know each other and take it from there.",
    "Forget icebreakers. Let’s get to the good stuff: What brings you the most joy?",
    "You look so familiar! Did we have chemistry together?",
    "Are you my appendix? Because I have this feeling in my stomach like I want to take you out.",
    "I just bought a kiss-proof lipstick, and I want to test it out.",
    "On a scale of one to 10, I’m a nine. But you’re the one I need.",
    "I guess the pandemic is far from over because your smile is contagious.",
    "I heard you like bad girls. Well, I’m bad at a lot of things.",
    "Do I know you? You look a lot like my next boyfriend.",
    "Are you a good cuddler? Because if so, I might let you join my gang.",
    "Do you believe in love at first sight, or should I delete this match and try again?",
    "If you could be any comic book character, who would you be?",
    "Having fun isn’t hard when you’ve got a library card, but I don’t need one to check you out.",
    "Do you know what’s most interesting about your profile?",
    "Are you my oven? Because you’re hot, and I want you to make me dinner.",
    "You don’t know how many times I’ve had to swipe left to find you.",
    "Will you be my Tinderella?",
    "Let’s just set an anniversary date right now.",
    "I don’t cook good pancakes—I cook great pancakes. Brunch?",
    "Just call me Shrek because I’m head ogre heels for you.",
    "Are you my lost luggage? Because I’ve been having so much trouble finding you.",
    "You’re so gorgeous that I forgot my best pickup line.",
    "You seem nice. Want to share Netflix passwords (and, you know, date)?",
    "You’re pretty, and I’m cute. Together we could be pretty cute!",
    "Do you know what’s on the menu tonight? Me ‘n’ u.",
    "I’m not really this tall. I’m just sitting on my wallet.",
    "I just became an organ donor so I could give you my heart.",
    "Have you been to the doctor recently? I think you’re lacking some vitamin me.",
    "Array.from(document.querySelectorAll('ul > li')).filter((l) => { return l.classList.length === 0 }).map((l) => { return l.textContent.trim() }).filter((l) => { return !!l })"
]
